CSI API ETABS v1
cAnalyze.SetDesignResponseOption Method
 Sets the design and response recovery options.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetDesignResponseOption(
	int NumberDesignThreads,
	int NumberResponseRecoveryThreads,
	int UseMemoryMappedFilesForResponseRecovery,
	bool ModelDifferencesOKWhenMergingResults
)
Function SetDesignResponseOption (
	NumberDesignThreads As Integer,
	NumberResponseRecoveryThreads As Integer,
	UseMemoryMappedFilesForResponseRecovery As Integer,
	ModelDifferencesOKWhenMergingResults As Boolean
) As Integer
Dim instance As cAnalyze
Dim NumberDesignThreads As Integer
Dim NumberResponseRecoveryThreads As Integer
Dim UseMemoryMappedFilesForResponseRecovery As Integer
Dim ModelDifferencesOKWhenMergingResults As Boolean
Dim returnValue As Integer
returnValue = instance.SetDesignResponseOption(NumberDesignThreads,
	NumberResponseRecoveryThreads,
	UseMemoryMappedFilesForResponseRecovery,
	ModelDifferencesOKWhenMergingResults)
int SetDesignResponseOption(
	int NumberDesignThreads,
	int NumberResponseRecoveryThreads,
	int UseMemoryMappedFilesForResponseRecovery,
	bool ModelDifferencesOKWhenMergingResults
)
abstract SetDesignResponseOption :
        NumberDesignThreads : int *
        NumberResponseRecoveryThreads : int *
        UseMemoryMappedFilesForResponseRecovery : int *
        ModelDifferencesOKWhenMergingResults : bool -> int
Parameters
NumberDesignThreads
Type: System.Int32
 Number of threads that design can use. Set to positive for user specified, non-positice for program determined.
NumberResponseRecoveryThreads
Type: System.Int32
 Number of threads that response recovery can use. Set to positive for user specified, non-positive for program determined.
UseMemoryMappedFilesForResponseRecovery
Type: System.Int32
 Flag for using memory mapped files for response recovery. Set to
-1 = Do not use memory mapped files.
0 = Program determined.
1 = Use memory mapped files.
ModelDifferencesOKWhenMergingResults
Type: System.Boolean
 Flag for merging results in presence of any model differences. Set to true to enable merging of results from two models that are not identical, to false otherwise.
Return Value
Type: Int32
 Returns zero if the options are successfully set; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set model solver options
       ret = SapModel.Analyze.SetDesignResponseOption(4, 4, 0, False)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalyze Interface
ETABSv1 Namespace